# Terraform `environment` `at22`
#### Initialization ⚙️`success`
#### Format and Style 🖌`success`
#### Validation 🤖`success`
<details><summary>Validation Output</summary>

```

Success! The configuration is valid.


```

</details>

#### Plan 📖`success`

<details><summary>Show Plan</summary>

```

[Lines containing Refreshing state removed]
[Truncated to 120000 bytes! See logoutput for complete plan]
Acquiring state lock. This may take a few moments...
module.postgres_server.data.azurerm_virtual_network.hub: Reading...
module.rbac.data.azurerm_client_config.hub: Reading...
module.rbac.data.azurerm_resource_group.hub: Reading...
module.appsettings.data.azurerm_client_config.hub: Reading...
module.rbac_platform_app["2ac064c5-5241-4097-a2d6-a27c077f1f51"].data.azurerm_client_config.hub: Reading...
module.appsettings.data.azurerm_resource_group.hub: Reading...
module.rbac_platform_app["9b2c69fa-b718-42cc-8eb6-b969a8238604"].data.azurerm_client_config.hub: Reading...
module.rbac_platform_app["9b2c69fa-b718-42cc-8eb6-b969a8238604"].data.azurerm_resource_group.hub: Reading...
module.rbac_platform_app["9b2c69fa-b718-42cc-8eb6-b969a8238604"].data.azurerm_client_config.hub: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjQ0YzE3OS1kZTg2LTRjMDYtYTY3YS0xMTQ3N2ExNGNhMzc7b2JqZWN0SWQ9NmVhZWQyM2UtZGY3Zi00NzA4LTljOGUtYTdmMzRkZWVhZGI0O3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.rbac_platform_app["2ac064c5-5241-4097-a2d6-a27c077f1f51"].data.azurerm_client_config.hub: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjQ0YzE3OS1kZTg2LTRjMDYtYTY3YS0xMTQ3N2ExNGNhMzc7b2JqZWN0SWQ9NmVhZWQyM2UtZGY3Zi00NzA4LTljOGUtYTdmMzRkZWVhZGI0O3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.appsettings.data.azurerm_client_config.hub: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjQ0YzE3OS1kZTg2LTRjMDYtYTY3YS0xMTQ3N2ExNGNhMzc7b2JqZWN0SWQ9NmVhZWQyM2UtZGY3Zi00NzA4LTljOGUtYTdmMzRkZWVhZGI0O3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.rbac.data.azurerm_client_config.hub: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjQ0YzE3OS1kZTg2LTRjMDYtYTY3YS0xMTQ3N2ExNGNhMzc7b2JqZWN0SWQ9NmVhZWQyM2UtZGY3Zi00NzA4LTljOGUtYTdmMzRkZWVhZGI0O3N1YnNjcmlwdGlvbklkPTAxZGU0OWNiLTQ4ZWYtNDQ5NC1iYzlkLWI5ZTE5YTkwYmNkNTt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.rbac_platform_app["2ac064c5-5241-4097-a2d6-a27c077f1f51"].data.azurerm_resource_group.hub: Reading...
module.key_vault.data.azurerm_private_dns_zone.key_vault: Reading...
module.rbac_platform_app["9b2c69fa-b718-42cc-8eb6-b969a8238604"].data.azurerm_resource_group.hub: Read complete after 1s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub]
module.rbac_platform_app["2ac064c5-5241-4097-a2d6-a27c077f1f51"].data.azurerm_resource_group.hub: Read complete after 1s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub]
module.key_vault.data.azurerm_client_config.current: Reading...
data.azurerm_subnet.postgres: Reading...
module.key_vault.data.azurerm_log_analytics_workspace.log_dwh: Reading...
module.key_vault.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjQ0YzE3OS1kZTg2LTRjMDYtYTY3YS0xMTQ3N2ExNGNhMzc7b2JqZWN0SWQ9NmVhZWQyM2UtZGY3Zi00NzA4LTljOGUtYTdmMzRkZWVhZGI0O3N1YnNjcmlwdGlvbklkPTM3YmFjNjNhLWI5NjQtNDZiMi04ZGU4LWJhOTNjNDMyZWExZjt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
module.rbac.data.azurerm_resource_group.spoke: Reading...
module.key_vault.data.azurerm_private_dns_zone.key_vault: Read complete after 1s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/privateDnsZones/privatelink.vaultcore.azure.net]
module.rbac_platform_app["9b2c69fa-b718-42cc-8eb6-b969a8238604"].data.azurerm_resource_group.spoke: Reading...
module.rbac.data.azurerm_resource_group.hub: Read complete after 1s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub]
data.azurerm_user_assigned_identity.admin: Reading...
module.appsettings.data.azurerm_resource_group.hub: Read complete after 1s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub]
module.rbac_platform_app["2ac064c5-5241-4097-a2d6-a27c077f1f51"].data.azurerm_resource_group.spoke: Reading...
module.postgres_server.data.azurerm_client_config.current: Reading...
module.postgres_server.data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjQ0YzE3OS1kZTg2LTRjMDYtYTY3YS0xMTQ3N2ExNGNhMzc7b2JqZWN0SWQ9NmVhZWQyM2UtZGY3Zi00NzA4LTljOGUtYTdmMzRkZWVhZGI0O3N1YnNjcmlwdGlvbklkPTM3YmFjNjNhLWI5NjQtNDZiMi04ZGU4LWJhOTNjNDMyZWExZjt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
data.azurerm_client_config.current: Reading...
data.azurerm_client_config.current: Read complete after 0s [id=Y2xpZW50Q29uZmlncy9jbGllbnRJZD03MjQ0YzE3OS1kZTg2LTRjMDYtYTY3YS0xMTQ3N2ExNGNhMzc7b2JqZWN0SWQ9NmVhZWQyM2UtZGY3Zi00NzA4LTljOGUtYTdmMzRkZWVhZGI0O3N1YnNjcmlwdGlvbklkPTM3YmFjNjNhLWI5NjQtNDZiMi04ZGU4LWJhOTNjNDMyZWExZjt0ZW5hbnRJZD1jZDAwMjZkOC0yODNiLTRhNTUtOWJmYS1kMGVmNGE4YmEyMWM=]
data.azurerm_subnet.default: Reading...
module.postgres_server.data.azurerm_virtual_network.hub: Read complete after 2s [id=/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.Network/virtualNetworks/vnetaltinnauth001hub]
data.azurerm_subnet.postgres: Read complete after 1s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at22/providers/Microsoft.Network/virtualNetworks/vnetssaltinnauth001at22/subnets/Postgres]
module.key_vault.data.azurerm_resource_group.key_vault: Reading...
module.rbac_platform_app["9b2c69fa-b718-42cc-8eb6-b969a8238604"].data.azurerm_resource_group.spoke: Read complete after 1s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at22]
module.key_vault.data.azurerm_resource_group.key_vault: Read complete after 0s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauthregister001at22]
module.rbac_platform_app["2ac064c5-5241-4097-a2d6-a27c077f1f51"].data.azurerm_resource_group.spoke: Read complete after 1s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at22]
module.rbac_platform_app["9b2c69fa-b718-42cc-8eb6-b969a8238604"].data.azurerm_servicebus_namespace.use_masstransit[0]: Reading...
module.rbac_platform_app["2ac064c5-5241-4097-a2d6-a27c077f1f51"].data.azurerm_servicebus_namespace.use_masstransit[0]: Reading...
data.azurerm_user_assigned_identity.admin: Read complete after 1s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at22/providers/Microsoft.ManagedIdentity/userAssignedIdentities/mipgsqladminaltinnauth001at22]
module.rbac.data.azurerm_resource_group.spoke: Read complete after 1s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at22]
module.rbac.data.azurerm_servicebus_namespace.use_masstransit[0]: Reading...
module.key_vault.data.azurerm_log_analytics_workspace.log_dwh: Read complete after 2s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at22/providers/Microsoft.OperationalInsights/workspaces/logdwhaltinnauth001at22]
data.azurerm_subnet.default: Read complete after 2s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at22/providers/Microsoft.Network/virtualNetworks/vnetdsaltinnauth001at22/subnets/Default]
module.rbac.data.azurerm_servicebus_namespace.use_masstransit[0]: Read complete after 1s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at22/providers/Microsoft.ServiceBus/namespaces/sbaltinnauth001at22]
module.rbac_platform_app["9b2c69fa-b718-42cc-8eb6-b969a8238604"].data.azurerm_servicebus_namespace.use_masstransit[0]: Read complete after 2s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at22/providers/Microsoft.ServiceBus/namespaces/sbaltinnauth001at22]
module.rbac_platform_app["2ac064c5-5241-4097-a2d6-a27c077f1f51"].data.azurerm_servicebus_namespace.use_masstransit[0]: Read complete after 2s [id=/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauth001at22/providers/Microsoft.ServiceBus/namespaces/sbaltinnauth001at22]
data.azurerm_key_vault_secret.register_maskinporten_jwk[0]: Reading...
data.azurerm_key_vault_secret.register_maskinporten_jwk[0]: Read complete after 0s [id=https://kvregaltinnauth001at22.vault.azure.net/secrets/maskinporten-register-jwk/fcb880b0419344a585f3c37a8fa3a707]

Terraform used the selected providers to generate the following execution
plan. Resource actions are indicated with the following symbols:
  + create
  ~ update in-place
-/+ destroy and then create replacement
 <= read (data resources)

Terraform will perform the following actions:

  # data.azurerm_key_vault_secret.postgres_app will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "postgres_app" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauthregister001at22/providers/Microsoft.KeyVault/vaults/kvregaltinnauth001at22"
      + name                    = "db-psqlsrvaltinnauthregister001at22-register-app"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # data.azurerm_key_vault_secret.postgres_migration will be read during apply
  # (depends on a resource or a module with changes pending)
 <= data "azurerm_key_vault_secret" "postgres_migration" {
      + content_type            = (known after apply)
      + expiration_date         = (known after apply)
      + id                      = (known after apply)
      + key_vault_id            = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauthregister001at22/providers/Microsoft.KeyVault/vaults/kvregaltinnauth001at22"
      + name                    = "db-psqlsrvaltinnauthregister001at22-register-migrator"
      + not_before_date         = (known after apply)
      + resource_id             = (known after apply)
      + resource_versionless_id = (known after apply)
      + tags                    = (known after apply)
      + value                   = (sensitive value)
      + versionless_id          = (known after apply)
    }

  # null_resource.bootstrap_database must be replaced
-/+ resource "null_resource" "bootstrap_database" {
      ~ id       = "7179585811827650726" -> (known after apply)
      ~ triggers = { # forces replacement
          ~ "ts" = "2026-03-09T09:07:17Z" -> (known after apply)
        }
    }

  # module.appsettings.azurerm_app_configuration_key.labels_values["at22-register|Altinn:register:Ccr:Update:Enabled"] will be created
  + resource "azurerm_app_configuration_key" "labels_values" {
      + configuration_store_id = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.AppConfiguration/configurationStores/appconfaltinnauth001hub"
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + id                     = (known after apply)
      + key                    = "Altinn:register:Ccr:Update:Enabled"
      + label                  = "at22-register"
      + locked                 = false
      + type                   = "kv"
      + value                  = "false"
    }

  # module.appsettings.azurerm_app_configuration_key.labels_values["at22-register|Altinn:register:Ccr:Update:Record"] will be created
  + resource "azurerm_app_configuration_key" "labels_values" {
      + configuration_store_id = "/subscriptions/01de49cb-48ef-4494-bc9d-b9e19a90bcd5/resourceGroups/rgaltinnauth001hub/providers/Microsoft.AppConfiguration/configurationStores/appconfaltinnauth001hub"
      + content_type           = (known after apply)
      + etag                   = (known after apply)
      + id                     = (known after apply)
      + key                    = "Altinn:register:Ccr:Update:Record"
      + label                  = "at22-register"
      + locked                 = false
      + type                   = "kv"
      + value                  = "true"
    }

  # module.appsettings.azurerm_app_configuration_key.labels_vault_references["at22-register|Altinn:Npgsql:register:ConnectionString"] will be updated in-place
  ~ resource "azurerm_app_configuration_key" "labels_vault_references" {
        id                     = "https://appconfaltinnauth001hub.azconfig.io/kv/Altinn:Npgsql:register:ConnectionString?label=at22-register"
        tags                   = {}
      ~ vault_key_reference    = "https://kvregaltinnauth001at22.vault.azure.net/secrets/db-psqlsrvaltinnauthregister001at22-register-app" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.appsettings.azurerm_app_configuration_key.labels_vault_references["at22-register|Altinn:Npgsql:register:Migrate:ConnectionString"] will be updated in-place
  ~ resource "azurerm_app_configuration_key" "labels_vault_references" {
        id                     = "https://appconfaltinnauth001hub.azconfig.io/kv/Altinn:Npgsql:register:Migrate:ConnectionString?label=at22-register"
        tags                   = {}
      ~ vault_key_reference    = "https://kvregaltinnauth001at22.vault.azure.net/secrets/db-psqlsrvaltinnauthregister001at22-register-migrator" -> (known after apply)
        # (8 unchanged attributes hidden)
    }

  # module.postgres_server.azurerm_postgresql_flexible_server.postgres_server will be updated in-place
  ~ resource "azurerm_postgresql_flexible_server" "postgres_server" {
      ~ administrator_password            = (sensitive value)
        id                                = "/subscriptions/37bac63a-b964-46b2-8de8-ba93c432ea1f/resourceGroups/rgaltinnauthregister001at22/providers/Microsoft.DBforPostgreSQL/flexibleServers/psqlsrvaltinnauthregister001at22"
        name                              = "psqlsrvaltinnauthregister001at22"
        tags                              = {}
        # (20 unchanged attributes hidden)

        # (1 unchanged block hidden)
    }

  # module.postgres_server.random_password.pass must be replaced
-/+ resource "random_password" "pass" {
      ~ bcrypt_hash      = (sensitive value)
      ~ id               = "none" -> (known after apply)
      ~ keepers          = { # forces replacement
          ~ "trigger" = "2026-03-09T09:06:07Z" -> (known after apply)
        }
      ~ result           = (sensitive value)
        # (11 unchanged attributes hidden)
    }

Plan: 4 to add, 3 to change, 2 to destroy.

─────────────────────────────────────────────────────────────────────────────

Saved the plan to: tfplan.out

To perform exactly these actions, run the following command to apply:
    terraform apply "tfplan.out"
Releasing state lock. This may take a few moments...

```

</details>

| Context | Values |
| - | - |
| Pusher | @Alxandr |
| Action | `push` |
| Working Directory | `src/apps/Altinn.Register/infra` |
| State File | `github.com/altinn/altinn-authorization-tmp/environments/at22/altinn.register.tfstate` |
| Plan File | `github.com_altinn_altinn-authorization-tmp_environments_at22_altinn.register.tfstate.tfplan` |